apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k1xx_sim.h
/****************************************************************************************************
 * arch/arm/src/s32k1xx/chip/s32k1xx_sim.h
 *
 *   Copyright (C) 2019 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_SIM_H
#define __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K1XX_SIM_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>
#include <hardware/s32k1xx_memorymap.h>

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

/* SIM Register Offsets *****************************************************************************/

#define S32K1XX_SIM_CHIPCTL_OFFSET              0x0004  /* Chip Control register */
#define S32K1XX_SIM_FTMOPT0_OFFSET              0x000c  /* FTM Option Register 0 */
#define S32K1XX_SIM_LPOCLKS_OFFSET              0x0010  /* LPO Clock Select Register */
#define S32K1XX_SIM_ADCOPT_OFFSET               0x0018  /* ADC Options Register */
#define S32K1XX_SIM_FTMOPT1_OFFSET              0x001c  /* FTM Option Register 1 */
#define S32K1XX_SIM_MISCTRL0_OFFSET             0x0020  /* Miscellaneous control register 0 */
#define S32K1XX_SIM_SDID_OFFSET                 0x0024  /* System Device Identification Register */
#define S32K1XX_SIM_PLATCGC_OFFSET              0x0040  /* Platform Clock Gating Control Register */
#define S32K1XX_SIM_FCFG1_OFFSET                0x004c  /* Flash Configuration Register 1 */
#define S32K1XX_SIM_UIDH_OFFSET                 0x0054  /* Unique Identification Register High */
#define S32K1XX_SIM_UIDMH_OFFSET                0x0058  /* Unique Identification Register Mid-High */
#define S32K1XX_SIM_UIDML_OFFSET                0x005c  /* Unique Identification Register Mid Low */
#define S32K1XX_SIM_UIDL_OFFSET                 0x0060  /* Unique Identification Register Low */
#define S32K1XX_SIM_CLKDIV4_OFFSET              0x0068  /* System Clock Divider Register 4 */
#define S32K1XX_SIM_MISCTRL1_OFFSET             0x006c  /* Miscellaneous Control register 1 */

/* SIM Register Addresses ***************************************************************************/

#define S32K1XX_SIM_CHIPCTL                     (S32K1XX_SIM_BASE + S32K1XX_SIM_CHIPCTL_OFFSET)
#define S32K1XX_SIM_FTMOPT0                     (S32K1XX_SIM_BASE + S32K1XX_SIM_FTMOPT0_OFFSET)
#define S32K1XX_SIM_LPOCLKS                     (S32K1XX_SIM_BASE + S32K1XX_SIM_LPOCLKS_OFFSET)
#define S32K1XX_SIM_ADCOPT                      (S32K1XX_SIM_BASE + S32K1XX_SIM_ADCOPT_OFFSET)
#define S32K1XX_SIM_FTMOPT1                     (S32K1XX_SIM_BASE + S32K1XX_SIM_FTMOPT1_OFFSET)
#define S32K1XX_SIM_MISCTRL0                    (S32K1XX_SIM_BASE + S32K1XX_SIM_MISCTRL0_OFFSET)
#define S32K1XX_SIM_SDID                        (S32K1XX_SIM_BASE + S32K1XX_SIM_SDID_OFFSET)
#define S32K1XX_SIM_PLATCGC                     (S32K1XX_SIM_BASE + S32K1XX_SIM_PLATCGC_OFFSET)
#define S32K1XX_SIM_FCFG1                       (S32K1XX_SIM_BASE + S32K1XX_SIM_FCFG1_OFFSET)
#define S32K1XX_SIM_UIDH                        (S32K1XX_SIM_BASE + S32K1XX_SIM_UIDH_OFFSET)
#define S32K1XX_SIM_UIDMH                       (S32K1XX_SIM_BASE + S32K1XX_SIM_UIDMH_OFFSET)
#define S32K1XX_SIM_UIDML                       (S32K1XX_SIM_BASE + S32K1XX_SIM_UIDML_OFFSET)
#define S32K1XX_SIM_UIDL                        (S32K1XX_SIM_BASE + S32K1XX_SIM_UIDL_OFFSET)
#define S32K1XX_SIM_CLKDIV4                     (S32K1XX_SIM_BASE + S32K1XX_SIM_CLKDIV4_OFFSET)
#define S32K1XX_SIM_MISCTRL1                    (S32K1XX_SIM_BASE + S32K1XX_SIM_MISCTRL1_OFFSET)

/* SIM Register Bitfield Definitions ****************************************************************/

/* Chip Control register */

#define SIM_CHIPCTL_ADC_INTERLEAVE_EN_SHIFT     (0)      /* Bits 0-3: ADC interleave channel enable */
#define SIM_CHIPCTL_ADC_INTERLEAVE_EN_MASK      (15 << SIM_CHIPCTL_ADC_INTERLEAVE_EN_SHIFT)
#  define SIM_CHIPCTL_ADC_INTERLEAVE_PTB14      (8 << SIM_CHIPCTL_ADC_INTERLEAVE_EN_SHIFT)
#  define SIM_CHIPCTL_ADC_INTERLEAVE_PTB13      (4 << SIM_CHIPCTL_ADC_INTERLEAVE_EN_SHIFT)
#  define SIM_CHIPCTL_ADC_INTERLEAVE_PTB1       (2 << SIM_CHIPCTL_ADC_INTERLEAVE_EN_SHIFT)
#  define SIM_CHIPCTL_ADC_INTERLEAVE_PTB0       (0 << SIM_CHIPCTL_ADC_INTERLEAVE_EN_SHIFT)
#define SIM_CHIPCTL_CLKOUTSEL_SHIFT             (4)      /* Bits 4-7: CLKOUT Select */
#define SIM_CHIPCTL_CLKOUTSEL_MASK              (15 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_SCGC_LKOUT      (0 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_SOSC_DIV2_CLK   (2 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_SIRC_DIV2_CLK   (4 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_QSPI_SFIF_CLK_HYP_PREMUX (5 << SIM_CHIPCTL_CLKOUTSEL_SHIFT) /* (S32K148) */
#  define SIM_CHIPCTL_CLKOUTSEL_FIRC_DIV2_CLK   (6 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_HCLK            (7 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_SPLL_DIV2_CLK   (8 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_BUS_CLK         (9 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_LPO128K_CLK     (10 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_QSPI_MODULE_CLK (11 << SIM_CHIPCTL_CLKOUTSEL_SHIFT) /* (S32K148) */
#  define SIM_CHIPCTL_CLKOUTSEL_LPO_CLK         (12 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_QSPI_SFIF_CLK   (13 << SIM_CHIPCTL_CLKOUTSEL_SHIFT) /* (S32K148) */
#  define SIM_CHIPCTL_CLKOUTSEL_RTC_CLK         (14 << SIM_CHIPCTL_CLKOUTSEL_SHIFT)
#  define SIM_CHIPCTL_CLKOUTSEL_QSPI_2xSFIF_CLK (15 << SIM_CHIPCTL_CLKOUTSEL_SHIFT) /* S32K148) */
#define SIM_CHIPCTL_CLKOUTDIV_SHIFT             (8)       /* Bits 8-10:  CLKOUT Divide Ratio */
#define SIM_CHIPCTL_CLKOUTDIV_MASK              (7 << SIM_CHIPCTL_CLKOUTDIV_SHIFT)
#  define SIM_CHIPCTL_CLKOUTDIV(n)              ((uint32_t)(n) << SIM_CHIPCTL_CLKOUTDIV_SHIFT) /* n=1..8 */
#define SIM_CHIPCTL_CLKOUTEN                    (1 << 11) /* Bit 11: CLKOUT enable */
#define SIM_CHIPCTL_TRACECLK_SEL                (1 << 12) /* Bit 12: Debug trace clock select */
#define SIM_CHIPCTL_PDB_BB_SEL                  (1 << 13) /* Bit 13: PDB back-to-back select */
#define SIM_CHIPCTL_ADC_SUPPLY_SHIFT            (16)      /* Bits 16-18: Supplies monitored on ADC0 channel 0 */
#define SIM_CHIPCTL_ADC_SUPPLY_MASK             (7 << SIM_CHIPCTL_ADC_SUPPLY_SHIFT)
#  define SIM_CHIPCTL_ADC_SUPPLY_VDD            (0 << SIM_CHIPCTL_ADC_SUPPLY_SHIFT) /* 5V input VDD supply */
#  define SIM_CHIPCTL_ADC_SUPPLY_VDDA           (1 << SIM_CHIPCTL_ADC_SUPPLY_SHIFT) /* 5V input analog supply */
#  define SIM_CHIPCTL_ADC_SUPPLY_VREFH          (2 << SIM_CHIPCTL_ADC_SUPPLY_SHIFT) /* ADC Reference Supply */
#  define SIM_CHIPCTL_ADC_SUPPLY_VDD_3V         (3 << SIM_CHIPCTL_ADC_SUPPLY_SHIFT) /* 3.3V Oscillator Regulator Output */
#  define SIM_CHIPCTL_ADC_SUPPLY_VDD_FLASH_3V   (4 << SIM_CHIPCTL_ADC_SUPPLY_SHIFT) /* 3.3V flash regulator output */
#  define SIM_CHIPCTL_ADC_SUPPLY_VDD_LV         (5 << SIM_CHIPCTL_ADC_SUPPLY_SHIFT) /* 1.2V core regulator output */
#define SIM_CHIPCTL_ADC_SUPPLYEN                (1 << 19) /* Bit 19:  Enable supply montorign ADC0 channel 0 */
#define SIM_CHIPCTL_SRAMU_RETEN                 (1 << 20) /* Bit 20: SRAMU retention */
#define SIM_CHIPCTL_SRAML_RETEN                 (1 << 21) /* Bit 21: SRAML retention */

